const { SlashCommandBuilder } = require('discord.js');

module.exports = {
	data: new SlashCommandBuilder()
		.setName('8ball')
		.setDescription('Μαγική μπάλα? Ρώτα την κάτι...')
        .addStringOption(option =>
			option
				.setName('question')
				.setDescription('Η ερώτηση που θες να ρωτήσεις την μπάλα.')
                .setRequired(true)),
	async execute(interaction) {
        let eightball = [
            'Είναι βέβαιο.',
            'Είναι αναμφισβήτητα έτσι.',
            'Χωρίς αμφιβολία.',
            'Ναι σίγουρα.',
            'Μπορείτε να βασίζεστε σε αυτό.',
            'Όπως το βλέπω, ναι.',
            'Πιθανοτερο.',
            'Καλή προοπτική.',
            'Ναί.',
            'Τα σημάδια δείχνουν ναι.',
            "Απάντηση μουντή δοκιμάστε ξανά.",
            'Ρωτήστε ξανά αργότερα.',
            'Καλύτερα να μη σου πω τώρα.»',
            "Δεν μπορώ να προβλέψω τώρα.",
            'Συγκεντρωθείτε και ρωτήστε ξανά.',
            'Μην το υπολογίζεις.',
            'Η απάντησή μου είναι όχι.',
            'Οι πηγές μου λένε όχι.',
            "Οι προοπτικές δεν είναι τόσο καλές.",
            'Πολύ σίγουρο.',
            'Με τιποτα.',
            'Μπορεί',
            'Η απάντηση κρύβεται μέσα σου',
            'Οχι.',
            'Εξαρτάται από τη διάθεση του θεού <@886303788556759110>.',
            'Εξαρτάται από τη διάθεση του θεού <@915363889535930399>.',
            '||Όχι||',
            '||Ναι||',
            'Περιμένω',
            'Τελείωσε',
            'Ειναι μονο η αρχη',
            'Καλή τύχη',
        ];
        let index = (Math.floor(Math.random() * Math.floor(eightball.length)));
		await interaction.reply('"' + interaction.options.getString("question") + '"' + "\n" + eightball[index]);
	},
};